# IMPORT LIBRARY

In [1]:
import pandas as pd
import numpy as np

# LOAD DATA

In [2]:
df = pd.read_csv("dataset_after_EDA.csv")

In [3]:
df.head()

,loan_id,no_of_dependents,education,self_employed,income_annum,loan_amount,loan_term,cibil_score,residential_assets_value,commercial_assets_value,luxury_assets_value,bank_asset_value,loan_status
0,1,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,2,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,4,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4269 entries, 0 to 4268
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   loan_id                    4269 non-null   int64
 1    no_of_dependents          4269 non-null   int64
 2    education                 4269 non-null   object
 3    self_employed             4269 non-null   object
 4    income_annum              4269 non-null   int64
 5    loan_amount               4269 non-null   int64
 6    loan_term                 4269 non-null   int64
 7    cibil_score               4269 non-null   int64
 8    residential_assets_value  4269 non-null   int64
 9    commercial_assets_value   4269 non-null   int64
 10   luxury_assets_value       4269 non-null   int64
 11   bank_asset_value          4269 non-null   int64
 12   loan_status               4269 non-null   object
dtypes: int64(10), object(3)
memory usage: 433.7+ KB

In [5]:
df.columns

Index(['loan_id', ' no_of_dependents', ' education', ' self_employed',
       ' income_annum', ' loan_amount', ' loan_term', ' cibil_score',
       ' residential_assets_value', ' commercial_assets_value',
       ' luxury_assets_value', ' bank_asset_value', ' loan_status'],
      dtype='object')

# BERSIHKAN NAMA KOLOM & ISI

## Hilangkan spasi tersembunyi

In [6]:
df.columns = df.columns.str.strip()

## Bersihkan spasi pada data kategorikal

In [7]:
for col in df.select_dtypes(include='object').columns:
    df[col] = df[col].str.strip()

# UBAH NAMA KOLOM → BAHASA INDONESIA

In [8]:
rename_columns = {
    'loan_id': 'id_pinjaman',
    'no_of_dependents': 'jumlah_tanggungan',
    'education': 'pendidikan',
    'self_employed': 'wirausaha',
    'income_annum': 'pendapatan_tahunan',
    'loan_amount': 'jumlah_pinjaman',
    'loan_term': 'jangka_waktu_pinjaman',
    'cibil_score': 'skor_kredit',
    'residential_assets_value': 'aset_rumah',
    'commercial_assets_value': 'aset_usaha',
    'luxury_assets_value': 'aset_mewah',
    'bank_asset_value': 'aset_bank',
    'loan_status': 'status_pinjaman'
}

In [9]:
df.rename(columns=rename_columns, inplace=True)

In [10]:
df.columns

Index(['id_pinjaman', 'jumlah_tanggungan', 'pendidikan', 'wirausaha',
       'pendapatan_tahunan', 'jumlah_pinjaman', 'jangka_waktu_pinjaman',
       'skor_kredit', 'aset_rumah', 'aset_usaha', 'aset_mewah', 'aset_bank',
       'status_pinjaman'],
      dtype='object')

# DROP KOLOM ID KARENA TIDAK DIGUNAKAN

In [11]:
df = df.drop(columns=['id_pinjaman'])

In [12]:
df.head()

,jumlah_tanggungan,pendidikan,wirausaha,pendapatan_tahunan,jumlah_pinjaman,jangka_waktu_pinjaman,skor_kredit,aset_rumah,aset_usaha,aset_mewah,aset_bank,status_pinjaman
0,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000,Approved
1,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000,Rejected
2,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000,Rejected
3,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000,Rejected
4,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000,Rejected

# MEYIMPAN DATASET VERSI BAHASA INDONESIA (UNTUK JAGA JAGA)

In [13]:
df.to_csv("dataset_preprocessing_bahasa_indonesia.csv", index=False)

# MENGECEK KEMBALI MISSING VALUE

In [14]:
df.isnull().sum()

jumlah_tanggungan        0
pendidikan               0
wirausaha                0
pendapatan_tahunan       0
jumlah_pinjaman          0
jangka_waktu_pinjaman    0
skor_kredit              0
aset_rumah               0
aset_usaha               0
aset_mewah               0
aset_bank                0
status_pinjaman          0
dtype: int64

# Memisahkan FITUR (X) DAN TARGET (y)

In [15]:
X = df.drop(columns=['status_pinjaman'])
y = df['status_pinjaman']

In [16]:
X.head()

,jumlah_tanggungan,pendidikan,wirausaha,pendapatan_tahunan,jumlah_pinjaman,jangka_waktu_pinjaman,skor_kredit,aset_rumah,aset_usaha,aset_mewah,aset_bank
0,2,Graduate,No,9600000,29900000,12,778,2400000,17600000,22700000,8000000
1,0,Not Graduate,Yes,4100000,12200000,8,417,2700000,2200000,8800000,3300000
2,3,Graduate,No,9100000,29700000,20,506,7100000,4500000,33300000,12800000
3,3,Graduate,No,8200000,30700000,8,467,18200000,3300000,23300000,7900000
4,5,Not Graduate,Yes,9800000,24200000,20,382,12400000,8200000,29400000,5000000

In [17]:
y.value_counts()

status_pinjaman
Approved    2656
Rejected    1613
Name: count, dtype: int64

# Mengidentifikasi TIPE DATA

In [18]:
kolom_kategorikal = X.select_dtypes(include='object').columns.tolist()
kolom_numerik = X.select_dtypes(exclude='object').columns.tolist()

print("Kolom kategorikal:", kolom_kategorikal)
print("Kolom numerik:", kolom_numerik)

Kolom kategorikal: ['pendidikan', 'wirausaha']
Kolom numerik: ['jumlah_tanggungan', 'pendapatan_tahunan', 'jumlah_pinjaman', 'jangka_waktu_pinjaman', 'skor_kredit', 'aset_rumah', 'aset_usaha', 'aset_mewah', 'aset_bank']

# ENCODING DATA KATEGORIKAL

In [19]:
X = pd.get_dummies(X, columns=kolom_kategorikal, drop_first=True)

# SCALING DATA NUMERIK

In [20]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X[kolom_numerik] = scaler.fit_transform(X[kolom_numerik])

# Pengecekan Akhir dataset

In [21]:
X.head()

,jumlah_tanggungan,pendapatan_tahunan,jumlah_pinjaman,jangka_waktu_pinjaman,skor_kredit,aset_rumah,aset_usaha,aset_mewah,aset_bank,pendidikan_Not Graduate,wirausaha_Yes
0,-0.294102,1.617979,1.633052,0.192617,1.032792,-0.780058,2.877289,0.832028,0.930304,False,False
1,-1.473548,-0.341750,-0.324414,-0.508091,-1.061051,-0.733924,-0.631921,-0.694993,-0.515936,True,True
2,0.295621,1.439822,1.610933,1.594031,-0.544840,-0.057300,-0.107818,1.996520,2.407316,False,False
3,0.295621,1.119139,1.721525,-0.508091,-0.771045,1.649637,-0.381263,0.897943,0.899533,False,False
4,1.475067,1.689242,1.002681,1.594031,-1.264055,0.757724,0.735304,1.568075,0.007172,True,True

In [22]:
X.shape

(4269, 11)

# SIMPAN DATASET SIAP MODEL

In [23]:
X.to_csv("X_preprocessing_ready.csv", index=False)
y.to_csv("y_target.csv", index=False)

# Meyimpan scaller

In [ ]:

import joblib

joblib.dump(scaler, 'scaler.pkl')

✅ Scaler berhasil disimpan sebagai 'scaler.pkl'
Sekarang file ini bisa digunakan untuk preprocessing data input baru di API.